
public class Main02 {
	//메인 매서드  :프로그램 실행 목적
	public static void main(String[] args) {
		
		//키워트, 예약어: 컴퓨터가 사용하기 위해 사전 정의 되어 있는 단어
		
		//조건문
		//if -> 만약 ~한다면
		//else if -> 조건이 참이면 이후 조건문은 검사하지 않음(최적화 목적)
		//
		
		//연산자
		//산술연산자
		//+, -, *, *, /(몫만 반환), %(나누기했을때의 값)
		//비교연산자
		//<, >, <=, >=, ==, !=
		//대입연산자
		//=
		//논리연산자
		//&&(and), ||(or)
		//증감연산자
		//+=, -=, ++, --
		
		if(true /*조건*/ ) { 
			System.out.println("true");
		}
		
		/*=================================================================================*/
		int age=20;
		
		if(age>19) {
			System.out.println("성인");
		}
		if(age<=19) {
			System.out.println("미성년자");
		}
		
		/*=================================================================================*/	
		if(age>19) {
			System.out.println("성인");
		}
		else {
			System.out.println("미성년자");
		}
		/*=================================================================================*/
	
	
		
		
	}
}
