
public class Main04 {
	public static void main(String[] args) {
		// while 반복문

		int i = 1;
		int k;

		while (i <= 3) {
			System.out.println("test1");
			i++;
		}

		System.out.println("\n==========================================");
		/*
		 * =============================================================================
		 * ===========
		 */

		// for 반복문

		for (int j = 1/* 1번(변수 선언이 반복문 밖에 영향을 미치지 않음) */; j <= 3/* 2번(조건문 검사) */; j++/* 4번 스텝증가 */) {
			System.out.println("test2");// 3번(반복문 실행)
		}

		System.out.println("\n==========================================");
		/*
		 * =============================================================================
		 * ===========
		 */

		for (i=1; i <= 2; i++) {
			k = 2147483647;
			System.out.println(k);
			k++;
		}

	}
}
